from additional_func import read_last_line_of_file, get_time_of_last_call


greetings = '''Привіт! Не знаеш де місце твоєї мрії? Хочеш попасти в райський куток?" \
	"Я допоможу тобі з цим! Також ти можеш грати у гру \'найширше очко\''''


############################# TIME #######################################################################


file_of_date = r'date.txt'
today = get_time_of_last_call()


############################# ASS_GAME ###################################################################


file_of_ass_stats = r'ass.txt'
users_in_ass_game = eval(read_last_line_of_file(file_of_ass_stats))
phrases_ignore_ass = ['ти вже грав!', 'чекай до завтра!', 'якщо часто гратися, то може й порватися!']


############################# LOCATOR_GAME ###############################################################


# африка, азия, европа, словакия, китай, австралия, бразилия, америка
centerts = [[48, 68], [0, 25], [48.40, 19.30], [38, 97], [-27, 133], [-15, -60], [50, -105]]

phrases_locator_1 = [
    'Супутники запущені 📡📡📡! Ведеться пошук...',
    'Ми обираєм найкраще для вас!',
    'Активуються геолокатори...',
    'Розвідка доносить дані...'
]

phrases_locator_2 = [
    'loading...',
    'waiting...'
]

phrases_locator_3 = [
    ' ваше місце знаходиться тут 👇',
    ' вам краще їхать сюди! НЕГАЙНО!!! 🚀',
    ' вас тут зачекались!',
    ' очевидно, це там 👇!'
]


############################# DDOS_ ###################################################################


file_of_ddos_users = r'ddos.txt'
users_ddos = eval(read_last_line_of_file(file_of_ddos_users))
ddos_phrase = "шот ап енд фак оф"


############################# ADDITIONAL ###################################################################

file_of_txt_messages = r'info.txt'

troll_ruslan_phrase = "shut up"

ruslic = [
    'Руслан', 'Русланом', 'Руслану', 'Руслана',
    'Костогрыза', 'Костогрызу', "Костогрыз", 'Костогрызом',
    "Костогриз", 'Костогриза', 'Костогризу', 'Костогризом',
    'Руслик', 'Руслику', 'Руслика', 'Русликом'
    "Руслік", 'Русліком', 'Русліку', "Русліка"
    'ruslik'
          ]
